%% 注意：代码文件仅供参考，一定不要直接用于自己的数模论文中
%% 国赛对于论文的查重要求非常严格，代码雷同也算作抄袭
%% 全套课程购买地址：https://k.youshop10.com/NjNu80mX
%% 全套教材PPT请关注微信公众号：大师兄的知识库

%% MATLAB非线性规划函数讲解
% 设目标函数为：
% min f(x) = x(1)^2 + x(2)^2 + x(3)^2 + 8
% s.t. -x(1) + x(2) - x(3) <= 0
%       x(1) + x(2)^2 + x(3)^2 - 20<= 0
%      -x(1) - x(2)^2 + 2 = 0
x0 = [0 0 0] %给x1 x2 x3赋初始值
A = [-1,1,-1]; %线性不等式的系数矩阵
b = [0];% 注意线性不等式即使没有常数项，也要填0
[x,val] = fmincon (@f1, x0, A, b, [], [], [], [], @nonlfun1)


%% 第二个例子讲解
% 设目标函数为：
% min -f(x) = -x(1)*x(2)*x(3)
% s.t. -x(1) + x(2) - x(3) <= 0
%       x(1) + x(2)^2 + x(3)^2 -20 <= 0
%       x(1)*x(2) - x(3) - 1 <= 0
%      -x(1) - x(2)^2 + 2 = 0
%       10<= x(1)<=20
%       x(1) - x(2) = 10
x0 = [0 0 0];% 给x1 x2 x3赋初始值
A = [-1,1,-1];% 线性不等式的系数矩阵
b = [0];% 线性不等式的常数向量
Aeq = [1,-1, 0];% 线性等式的系数矩阵
beq = [10];% 线性等式的常数向量
lb = [10; -Inf; -Inf];% 自变量的下限
ub = [20; +Inf; +Inf];% 自变量的上限
[x,val] = fmincon (@f2, x0, A, b, Aeq, beq, lb, ub, @nonlfun2)
val = -1 * val;

%% 注意：代码文件仅供参考，一定不要直接用于自己的数模论文中
%% 国赛对于论文的查重要求非常严格，代码雷同也算作抄袭
%% 全套课程购买地址：https://k.youshop10.com/NjNu80mX
%% 全套教材PPT请关注微信公众号：大师兄的知识库