%% 注意：代码文件仅供参考，一定不要直接用于自己的数模论文中
%% 国赛对于论文的查重要求非常严格，代码雷同也算作抄袭
%% 全套课程购买地址：https://k.youshop10.com/NjNu80mX
%% 全套教材PPT请关注微信公众号：大师兄的知识库

%% 用非线性规划解决燕双鹰打小怪兽问题
% 先确定Xij的个数一共是2*6=12个
x0 = zeros(1,12);% 给Xij赋初始值
Aeq = [eye(6),eye(6)];% 线性等式的系数矩阵
beq = [5;9;4;8;14;11];% 线性等式的常数项
A = [ones(1,6),zeros(1,6);zeros(1,6),ones(1,6)];% 线性不等式的系数矩阵
b = [30;20];% 线性不等式的常数项
lb = zeros(1,12);
ub = repmat(Inf, 1, 12);
[x,val] = fmincon (@f3, x0, A, b, Aeq, beq, lb, ub, []);


%% 注意：代码文件仅供参考，一定不要直接用于自己的数模论文中
%% 国赛对于论文的查重要求非常严格，代码雷同也算作抄袭
%% 全套课程购买地址：https://k.youshop10.com/NjNu80mX
%% 全套教材PPT请关注微信公众号：大师兄的知识库