%% 注意：代码文件仅供参考，一定不要直接用于自己的数模论文中
%% 国赛对于论文的查重要求非常严格，代码雷同也算作抄袭
%% 全套课程购买地址：https://k.youshop10.com/NjNu80mX
%% 全套教材PPT请关注微信公众号：大师兄的知识库

%% 绘制数字标号的图
s = [1 2 3]; %注意要从1开始标号，不能从0开始
t = [4 1 2]
w = [5 2 6]
%绘制带权重的图
G = graph(s, t, w);
plot(G, 'EdgeLabel', G.Edges.Weight, 'linewidth', 2); %调用plot绘制带权重的图
%绘制不带权重的图
G2 = graph(s, t);
plot(G2, 'linewidth', 2) %绘制不带权重的图
set( gca, 'XTick', [], 'YTick', [] ); %去掉坐标轴上的数字

%% 绘制字符串标号的图
s = {'北京', '上海', '广州', '深圳', '上海'}; %定义字符串元胞数组
t = {'上海', '广州', '深圳', '北京', '深圳'}
w = [10 65 3 90, 60];
G = graph(s, t, w);
plot(G, 'EdgeLabel', G.Edges.Weight, 'linewidth', 2)
set(gca, 'XTick', [], 'YTick', []);

%% 重点：绘制邻接矩阵表示的图
c = [0 15 10 20 0 0 0 0;
     0 0 0 0 7 10 0 0;
     0 0 0 0 0 8 2 0;
     0 0 0 0 0 0 18 0;
     0 0 0 0 0 0 0 6;
     0 0 0 0 0 0 0 16;
     0 0 0 0 0 0 0 20;
     0 0 0 0 0 0 0 0;]
 view(biograph(c, [], 'ShowWeights', 'on'));

%% 注意：代码文件仅供参考，一定不要直接用于自己的数模论文中
%% 国赛对于论文的查重要求非常严格，代码雷同也算作抄袭
%% 全套课程购买地址：https://k.youshop10.com/NjNu80mX
%% 全套教材PPT请关注微信公众号：大师兄的知识库
