%% 注意：代码文件仅供参考，一定不要直接用于自己的数模论文中
%% 国赛对于论文的查重要求非常严格，代码雷同也算作抄袭
%% 全套课程购买地址：https://k.youshop10.com/NjNu80mX
%% 全套教材PPT请关注微信公众号：大师兄的知识库

%% 用蒙特卡洛解决张麻子问题
clear;clc
n = 10000 %模拟次数
x1 = round(1 + rand(n,1) * 5); % round是个四舍五入取整函数，原理是a + k（b-a）
x2 = randi([1,6], n, 1); %randi可取一个随机整数
res_x1 = 0;
res_x2 = 0;
max_y = 0;
for i = 1 : n
    if(x1(i) + x2(i) <= 6)
        if(240*x1(i) + 120*x2(i) <= 1200)
            if(40*x1(i) + 30*x2(i) > max_y)
                max_y = 40*x1(i) + 30*x2(i);
                res_x1 = x1(i);
                res_x2 = x2(i);
            end
        end
    end
end


%% 注意：代码文件仅供参考，一定不要直接用于自己的数模论文中
%% 国赛对于论文的查重要求非常严格，代码雷同也算作抄袭
%% 全套课程购买地址：https://k.youshop10.com/NjNu80mX
%% 全套教材PPT请关注微信公众号：大师兄的知识库